// Отсортировать массив по возрастанию на интервале индексов от N1 до N2.

// Алгоритм сортировки выбором:
// с первого элемента проходимся по массиву
// находим мин. элмент в оставшейся части массива
// обмениваем текущий элемент с минимальным элементом
// начиная со второго элемента по новой находим мин. элемент в оставшейся части массива и обмениваем текущий элемент с минимальным

// реализуем алгоритм сортировки выбором

// принимаем массив и значение
void selectSort(int arr[], int n)
{
  for (int i = 0; i < n - 1; i++)
  {
  }
}